dict1 = {
    11: 'ёз',
    12: 'дувоз',
    13: 'сенз',
    14: 'чор',
    15: 'понз',
    16: 'шонз',
    17: 'ҳаб',
    18: 'ҳаж',
    19: 'нуз',
}
dict2 = {
    10: 'даҳ',
    20: 'бист',
    30: 'си',
    40: 'чил',
    50: 'панҷоҳ',
    60: 'шаст',
    70: 'ҳафтод',
    80: 'ҳаштод',
    90: 'навад',
}
dict3 = {
    1: 'як',
    2: 'ду',
    3: 'се',
    4: 'чор',
    5: 'панҷ',
    6: 'шаш',
    7: 'ҳафт',
    8: 'ҳашт',
    9: 'нуҳ',
}
n = int(input())
if n == 100:
    print('сад')
    exit()
a = n // 100
b = n // 10 % 10
c = n % 10
print(f'{dict3[a]} сад', end='')
if b or c:
    print(f'у', end=' ')
    if b and not c:
        print(dict2[b * 10])
    elif c and not b:
        print(dict3[c])
    else:
        if b == 1:
            print(f'{dict1[b * 10 + c]}даҳ')
        else:
            print(f'{dict2[b * 10]}у {dict3[c]}')
