n = int(input())
dict1 = {
    11: 'ёз',
    12: 'дувоз',
    13: 'сенз',
    14: 'чор',
    15: 'понз',
    16: 'шонз',
    17: 'ҳаб',
    18: 'ҳаж',
    19: 'нуз',
}
dict2 = {
    10: 'даҳ',
    20: 'бист',
    30: 'си',
    40: 'чил',
    50: 'панҷоҳ',
    60: 'шаст',
    70: 'ҳафтод',
    80: 'ҳаштод',
    90: 'навад',
}
dict3 = {
    1: 'як',
    2: 'ду',
    3: 'се',
    4: 'чор',
    5: 'панҷ',
    6: 'шаш',
    7: 'ҳафт',
    8: 'ҳашт',
    9: 'нуҳ',
}
if n in range(11, 20):
    print(f'{dict1[n]}даҳ', end=' ')
elif n in range(10, 100, 10):
    print(dict2[n], end=' ')
else:
    print(f'{("сиву" if n // 10 == 3 else dict2[n // 10 * 10] + "у")} {dict3[n % 10]}', end=' ')
print('масъала')
